<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"5d21d40d0e7bd795363eb8413b91f816905ee2ac785c69bff726f9242f8d1739","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #815 at https://github.com/cal-itp/data-infra/actions/runs/18605948458","plan_out_hash":"c86dc662cab946e23f5db57ef56e808d86241a8923db48e27a435e81f803d0b3","plan_hash":"ae896bf5250ebb19c184fd752392cb5d37f6e5b8acc377fba1b862478bc894ce","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/dbt_bigquery_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "SB2JCQ==" -> (known after apply)
!~      detect_md5hash      = "Es+Ib2v1h95uHNMfLiX+Bw==" -> "different hash"
!~      generation          = 1760736605979425 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/dbt_bigquery_to_gcs_operator.py"
!~      md5hash             = "Es+Ib2v1h95uHNMfLiX+Bw==" -> (known after apply)
        name                = "plugins/operators/dbt_bigquery_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "0SGZvg==" -> (known after apply)
!~      detect_md5hash      = "vEmCeYP8Sz4DZoNQN6MPpQ==" -> "different hash"
!~      generation          = 1760652968071111 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "vEmCeYP8Sz4DZoNQN6MPpQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "pcg8TA==" -> (known after apply)
!~      detect_md5hash      = "JDovwMcPMikn5bOHDo8kZg==" -> "different hash"
!~      generation          = 1760652969823503 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "JDovwMcPMikn5bOHDo8kZg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #815](https://github.com/cal-itp/data-infra/actions/runs/18605948458)